app/controllers/static_controller.rb

SELECT "items".* FROM "items" WHERE "items"."category" = 'home'
---
  def index
    @items = Item.all  :conditions => {:category => "home"}